## Задача 2. Напишите программу, которая принимает на вход координаты 
## двух точек и находит расстояние между ними в 2D пространстве.
## A (3,6); B (2,1) -> 5,09
## A (7,-5); B (1,-1) -> 7,21

ax = input('Введите координату x точки А: ')
ax = int(ax)
ay = input('Введите координату y точки А: ')
ay = int(ay)

bx = input('Введите координату x точки B: ')
bx = int(bx)
by = input('Введите координату y точки B: ')
by = int(by)

distance = ((bx - ax)**2 + (by - ay)**2)**0.5
distance = round(distance, 2)
print(distance)